app/controllers/workouts_controller.rb

  def create
    # render plain: params[:workout].inspect
    # throws an error when used with a redirect
    @workout = Workout.new(workout_params)

    @workout.save
---
INSERT INTO "workouts" ("created_at", "date", "text", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-17 01:50:47.077710"], ["date", "2014-07-12"], ["text", "brush teeth"], ["updated_at", "2014-07-17 01:50:47.077710"]]

  def show
    @workout = Workout.find(params[:id])
---
SELECT  "workouts".* FROM "workouts"  WHERE "workouts"."id" = ? LIMIT 1  [["id", 1]]